//################################################
// <Ambient.cpp>
//
//------------------------------------------------
// 2013/01/05 ~			SekiyamaRumi
//################################################
#ifndef _____AMBIENT_H_____
#define _____AMBIENT_H_____
//================================================
//インクルードヘッダ
//================================================
#include "include.h"	//インクルードヘッダ
#include "Object.h"		//オブジェクトヘッダ
#include "Common.h"		//共通
#include "MeshMng.h"	//メッシュマネージャ
//================================================
//ライブラリ定義
//================================================

//================================================
//定数定義
//================================================
#define CLOUD_NUM	(100)
//================================================
//構造体定義
//================================================
struct CLOUD
{
	VECTOR3	m_Pos;			//位置
	bool	m_Live;			//生存
	int		m_Time;			//生存時間
	float   m_Alpha;		//雲のα値
};
//================================================
//グローバル変数
//================================================

//================================================
//クラス定義
//================================================
class AMBIENT
{
private:
	float m_fogExp;				//フォグの濃度
	CLOUD	m_Cloud[CLOUD_NUM];
	GLuint	m_TexIDCloud;		//雲テクスチャ
	MESH	m_MeshCloud;		//雲メッシュ

	void FogUpdate(int num, int fogStart);	//霧効果
	void CloudSet(void);		//雲セット
	void CloudUpdate(void);		//雲効果
public:
	~AMBIENT();
	AMBIENT();
	void Init(void);			//初期化
	void Load(void);			//読み込み
	void Update(int num, int fogStart);		//更新
	void Reset(void);			//リセット
	void Draw(void);			//描画
};
//################################################
// End of File
//################################################
#endif _____AMBIENT_H_____
