//################################################
// <Collision.h>
//
//------------------------------------------------
// 2012/12/11 ~
//						SekiyamaRumi
// 2013/02/08	敵同士の当たり判定追加　Akihito Tanaka
//################################################
#ifndef _____COLLISION_H_____
#define _____COLLISION_H_____

//================================================
//インクルードヘッダ
//================================================
#include "Include.h"
#include "EnemyMng.h"
#include "Player.h"
#include "EffectMng.h"	//エフェクト

//================================================
//ライブラリ定義
//================================================

//================================================
//定数定義
//================================================

//================================================
//構造体定義
//================================================

//================================================
//グローバル変数
//================================================

//================================================
//プロトタイプ宣言
//================================================
class COLLISION
{
public:
	static COLLISION* Instance()
	{
		static COLLISION Inst;
		return &Inst;
	};
private:
	COLLISION();
	PLAYER		*m_pPlayer;
	ENEMYMNG	*m_pEnemy;
	bool		m_flgAtk;
	EFFECT_MNG *m_pEffect;

public:
	~COLLISION();
	void Update(void);

private:
	void CollisionEnemyAndPlayer(void);	//敵とプレイヤーの衝突判定
	void CollisionBossAndPlayer(void);	//ぼすとプレイヤーの衝突判定
	bool CollsionSphere(VECTOR3 pos, VECTOR3 pos2, float w, float w2);
};

//################################################
// End of File
//################################################
#endif _____COLLISION_H_____

