//################################################
// <DeadNum.cpp>
// ゲーム画面中、常にスコアの出力(2D)
//------------------------------------------------
// 2013/01/30 ~
//						SekiyamaRumi
//################################################
#ifndef _____DEAD_NUM_H_____
#define _____DEAD_NUM_H_____

//================================================
//インクルードヘッダ
//================================================
#include <windows.h>		//Windows プログラムにはこれを付ける
#include <tchar.h>			//汎用テキスト マッピング

#include "NumView.h"		//数値出力ヘッダ

//================================================
//定数定義
//================================================

//================================================
//クラス宣言
//================================================
class DEAD_NUM: public NUM_VIEW
{
private:
	DEAD_NUM(){}
	GLuint m_TexID;

public:
	static DEAD_NUM *Instance()
	{
		static DEAD_NUM Inst;
		return &Inst;
	}
	virtual ~DEAD_NUM(){}
	
	void SetTexID(GLuint TexID);				//テクスチャIDセット
	void SetNum(int nDeadNum);					//数値セット
	void SetVer(int X, int Y, int W, int H);	//テクスチャ情報
	void Draw(void);							//描画
};

//################################################
// End of File
//################################################
#endif _____DEAD_NUM_H_____
