//################################################
// <EnemyMng.h>
//
//------------------------------------------------
// 2012/12/03 ~
//						SekiyamaRumi
//################################################
#ifndef _____ENEMY_COMMON_H______
#define _____ENEMY_COMMON_H______

#include "EnemyNormal.h"		//ノーマル
#include "EnemyBoss.h"			//ボス

#define ENEMY_BOSS_NUM (1)		//ボスの数
#define ENEMY_NOMAL_NUM (20)	//ノーマルな敵の数
//################################################
// End of File
//################################################
#endif _____ENEMY_COMMON_H______