//################################################
// <EnemyBossHpBar.cpp>
//
//------------------------------------------------
// 2013/02/06 ~
//						SekiyamaRumi
//################################################
#ifndef _____BOSS_HP_BAR_H_____
#define _____BOSS_HP_BAR_H_____

//================================================
//インクルードヘッダ
//================================================
#include "Include.h"	//インクルードヘッダ
#include "Common.h"		//共通ヘッダ
#include "EnemyMng.h"	//
//================================================
//ライブラリ定義
//================================================

//================================================
//定数定義
//================================================
#define B_BAR_W	(600)
#define B_BAR_H	(120)
#define POS_B_BAR_X (120)	//初期位置
#define POS_B_BAR_Y (480)

//================================================
//構造体定義
//================================================

//================================================
//グローバル変数
//================================================

//================================================
//クラス定義
//================================================
class BOSS_HP_BAR
{
public:
	static BOSS_HP_BAR* Instance()
	{
		static BOSS_HP_BAR Inst;
		return &Inst;
	}
	~BOSS_HP_BAR();
private:
	BOSS_HP_BAR();
	ENEMYMNG	*m_pEnemyMng;
	//----------------------------
	// 0…フレーム
	// 1…バー
	// 2…カバー
	//----------------------------
	FVERTEX  m_Poly[3][4];		//板ポリ
	GLuint   m_TexID;		//テクスチャＩＤ
	
public:
	float  nM;
	void Init(void);
	void Reset(void);	//リセット
	void Load (void);	//読み込み
	void Update(int nHP, int nMaxHP);
	void Draw(void);
};
//################################################
// End of File
//################################################
#endif _____BOSS_HP_BAR_H_____
