//################################################
//<Fade.h>
// フェード関連
//------------------------------------------------
//2013/01/31 ~
//						SekiyamaRumi
//################################################
#ifndef _____FADE_H_____
#define _____FADE_H_____

//================================================
//インクルード
//================================================
#include "Main.h"
#include "Polygon.h"
//================================================
//定数定義
//================================================
//================================================
//構造体
//================================================

//================================================
//クラス定義
//================================================
class FADE
{
private:
	POLYGON3D	pol;
	int			m_nFrame;
public:
	FADE();
	~FADE();
	
	GLuint  m_TexID;		//テクスチャID	ポリ
	POLYGON3D m_PFade;		//フェード用ポリゴン
	void Reset();					//リセット

	void SetFrame(int frame);	//フレーム数取得	
	//フェード更新
	bool FadeIn(int time);	//フェードin
	bool FadeOut(int time);	//フェードout
	void Draw();					//描画
};

#endif _____FADE_H_____