//################################################
//<FBO.cpp>
// フレームバッファオブジェクト
//------------------------------------------------
//2012/01/30 ~
//						Akihito Tanaka
//################################################
#ifndef _____FBO_H______
#define _____FBO_H______

#include "include.h"
#include "common.h"


//================================================
//定数定義
//================================================
//================================================
//クラス定義
//================================================
class FBO{
private:
	GLuint texID;		//テクスチャID 
	GLuint fbID;		//フレームバッファID
	GLuint rbID;		//レンダーバッファID

public:
	FBO();
	~FBO();
	void Init();
	void Start();
	void End();
};

#endif _____FBO_H______