//################################################
// <Smoke.h>
//
//------------------------------------------------
// 2013/01/06 ~
//						SekiyamaRumi
//################################################
#ifndef _____SMOKE_H_____
#define _____SMOKE_H_____

//================================================
//インクルードヘッダ
//================================================
#include "include.h"
#include "Common.h"
#include "MeshMng.h"
#include "Effect.h"
//================================================
//ライブラリ定義
//================================================

//================================================
//定数定義
//================================================
#define SMOKE_NUM	(1000)
//================================================
//構造体定義
//================================================

//================================================
//グローバル変数
//================================================

//================================================
//プロトタイプ宣言
//================================================
class SMOKE:public EFFECT
{
public:
	static SMOKE* Instance(void)
	{
		static SMOKE inst;
		return &inst;
	};
	~SMOKE();
private:
	SMOKE();
	
	GLuint	m_TexID;	//テクスチャID
	MESH	m_Mesh;

//	void UpdateSmoke(void);		//煙の更新

public:
	BILLBOARD m_Smoke[SMOKE_NUM];

	void Init(void);	//初期化
	void Load(void);	//読み込み
	void Reset(void);	//リセット
	void UpDate(void);	//更新
	void SetSmoke(VECTOR3 vec);	//煙のセット
	void Draw(void);	//描画
	
};

//################################################
// End of File
//################################################
#endif _____SMOKE_H_____
