//################################################
//<TexMng.cpp>
// テクスチャ管理
//------------------------------------------------
//テクスチャマネージャ作成
//2012/06/27 ~
//						SekiyamaRumi
//################################################
#ifndef _____TEX_MNG_H______
#define _____TEX_MNG_H______

//================================================
//インクルードヘッダ
//================================================
#include "Main.h"
#include "Texture.h"
#include "glpng.h"	//PNGデータ読み込み

//================================================
//定数定義
//================================================
#define MAX_TEX		100			// テクスチャ最大数

//================================================
//クラス定義
//================================================
class TEX_MNG
{
private:
	GLuint	m_pTex[MAX_TEX];	// テクスチャ
	TCHAR	m_FileName[MAX_TEX][MAX_PATH];	// ファイル名
	TCHAR	m_Category[MAX_TEX][MAX_PATH];	// カテゴリ名

public:
	TEX_MNG();			// コンストラクタ
	~TEX_MNG();			// デストラクタ
	// テクスチャのポインタを得る
	GLuint GetTexture(char *name, char *cat);
	void ReleaseAll();	// 全テクスチャ破棄
	void ReleaseCat(TCHAR* cat);// カテゴリのテクスチャ破棄
};

//================================================
//グローバル変数
//================================================
extern TEX_MNG g_TexMng;

#endif _____TEX_MNG_H______
