//#############################################
//
// <Texture.h>
// テクスチャ関連モジュール
//						＊授業内　SekiyamaRumi
//
//#############################################
#ifndef _____H_TEXTURE______
#define _____H_TEXTURE______

//================================================
//インクルード
//================================================
#include <windows.h>		//Windows 関連のヘッダ

#include "Include.h"		//インクルード

//================================================
//プロトタイプ宣言
//================================================
GLuint LoadTexture(const char *pszFName);
void ReleaseTexture(GLuint uTexID);

//================================================
//ライブラリ
//================================================
#pragma comment(lib, "opengl32.lib")
#pragma comment(lib, "glu32.lib")

#endif	_____H_TEXTURE______